# Пользователь вводит целое трёхзначное число.
# Выведите сумму чисел числа.

num_str = input()
sum = int(num_str[0]) + int(num_str[1]) + int(num_str[2])
print(sum)
