# Дано число. Если оно положительно выведите yes, иначе no.

x = int(input())
if x > 0:
    print('yes')
else:
    print('no')
