# Даны два числа, если они равны выведите yes, иначе - no.

x = int(input())
y = int(input())

if x == y:
    print('yes')
else:
    print('no')
