# Даны два числа, вывести на экран максимальное из них.

x = int(input())
y = int(input())
if x > y:
    print(x)
else:
    print(y)
